<img src='dataframe.png'>

In [40]:
import pandas as pd

In [71]:
# membuat DataFrame menggunakan list
list1 = ['Raven Bierman','Female','2016-12-04',7000000]
list2 = ['Valter Havers','Male','2018-04-13',7000000]
list3 = ['Marko Mendell','Male','2018-07-04',15000000]
list4 = ['Takahiro Momota','Male','2016-11-18',12000000]
list5 = ['Yahiko Tielmans','Male','2017-05-26',20000000]
list6 = ['Dina Rebaine','Female','2015-03-20',15000000]

allList = [list1,list2,list3,list4,list5,list6]

row = [100111,100112,200210,200211,200312,300207]
column = ['name','gender','hire date','gross salary']

In [72]:
df = pd.DataFrame(allList, index=row, columns=column)
df

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tielmans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [73]:
name = ['Raven Bierman','Valter Havers','Marko Mendell','Takahiro Momota','Yahiko Tielmans','Dina Rebaine']
gender = ['Female','Male','Male','Male','Male','Female']
hire_date = ['2016-12-04','2018-04-13','2018-07-04','2016-11-18','2017-05-26','2015-03-20']
gross_salary = [7000000,7000000,15000000,12000000,20000000,15000000]

row = [100111,100112,200210,200211,200312,300207]
column = ['name','gender','hire date','gross salary']

In [74]:
# df = pd.DataFrame(list(zip(name,gender,hire_date,gross_salary)), index=row, columns=column)
# # zip untuk memasangkan index yg sama antar-list yg dipasangkan

# df

In [75]:
# df = pd.DataFrame([name,gender,hire_date,gross_salary], columns=row, index=column).T
# # .T adalah untuk transpose atau memutar baris menjadi kolom
# # .transpose()

# df

# Adding and Removing Data

In [76]:
df

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tielmans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [77]:
# menambah kolom pada DataFrame
df['nett salary'] = df['gross salary']*0.85
df

                   name  gender   hire date  gross salary  nett salary
100111    Raven Bierman  Female  2016-12-04       7000000    5950000.0
100112    Valter Havers    Male  2018-04-13       7000000    5950000.0
200210    Marko Mendell    Male  2018-07-04      15000000   12750000.0
200211  Takahiro Momota    Male  2016-11-18      12000000   10200000.0
200312  Yahiko Tielmans    Male  2017-05-26      20000000   17000000.0
300207     Dina Rebaine  Female  2015-03-20      15000000   12750000.0

In [78]:
# menghapus kolom dari DataFrame sementara
df.drop('nett salary', axis=1)

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tielmans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [79]:
# menghapus baris dari DataFrame sementara
df.drop(300207, axis=0)

                   name  gender   hire date  gross salary  nett salary
100111    Raven Bierman  Female  2016-12-04       7000000    5950000.0
100112    Valter Havers    Male  2018-04-13       7000000    5950000.0
200210    Marko Mendell    Male  2018-07-04      15000000   12750000.0
200211  Takahiro Momota    Male  2016-11-18      12000000   10200000.0
200312  Yahiko Tielmans    Male  2017-05-26      20000000   17000000.0

In [80]:
df.drop('nett salary', axis=1)

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tielmans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [81]:
df

                   name  gender   hire date  gross salary  nett salary
100111    Raven Bierman  Female  2016-12-04       7000000    5950000.0
100112    Valter Havers    Male  2018-04-13       7000000    5950000.0
200210    Marko Mendell    Male  2018-07-04      15000000   12750000.0
200211  Takahiro Momota    Male  2016-11-18      12000000   10200000.0
200312  Yahiko Tielmans    Male  2017-05-26      20000000   17000000.0
300207     Dina Rebaine  Female  2015-03-20      15000000   12750000.0

In [82]:
# menghapus baris dari DataFrame secara permanen dgn inplace
# tidak disarankan
# lebih baik buat variable baru untuk menyimpan dataframe yg sudah terubah, agar dataframe aslinya tetap ada

df.drop('nett salary', axis=1, inplace=True)

In [83]:
df

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tielmans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [85]:
df['gross salary']

100111     7000000
100112     7000000
200210    15000000
200211    12000000
200312    20000000
300207    15000000
Name: gross salary, dtype: int64

# Indexing and Selection

In [86]:
df

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tielmans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [87]:
# indexing menggunakan nama kolom
df['name']

100111      Raven Bierman
100112      Valter Havers
200210      Marko Mendell
200211    Takahiro Momota
200312    Yahiko Tielmans
300207       Dina Rebaine
Name: name, dtype: object

In [89]:
# indexing menggunakan nama kolom >1 dgn [[]]
df[['name','gross salary']]

                   name  gross salary
100111    Raven Bierman       7000000
100112    Valter Havers       7000000
200210    Marko Mendell      15000000
200211  Takahiro Momota      12000000
200312  Yahiko Tielmans      20000000
300207     Dina Rebaine      15000000

In [90]:
# df['kolom']['index']
df['name'][100111]

'Raven Bierman'

In [92]:
# df['kolom'][['index1','index2']]
df['name'][[100111,100112]]

100111    Raven Bierman
100112    Valter Havers
Name: name, dtype: object

# loc & iloc

In [112]:
df

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tielmans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [113]:
# loc melakukan indexing dengan nama kolom
df.loc[100111]

name            Raven Bierman
gender                 Female
hire date          2016-12-04
gross salary          7000000
Name: 100111, dtype: object

In [114]:
df.loc['name']

KeyError: 'name'

In [102]:
# iloc melakukan indexing dgn posisi index
df.iloc[0]

name            Raven Bierman
gender                 Female
hire date          2016-12-04
gross salary          7000000
Name: 100111, dtype: object

In [103]:
df.iloc[0:2]

                 name  gender   hire date  gross salary
100111  Raven Bierman  Female  2016-12-04       7000000
100112  Valter Havers    Male  2018-04-13       7000000

In [108]:
df.loc[[100111,100112],['name','gross salary']]

                 name  gross salary
100111  Raven Bierman       7000000
100112  Valter Havers       7000000

In [109]:
df[['name','gross salary']].loc[[100111,100112]]

                 name  gross salary
100111  Raven Bierman       7000000
100112  Valter Havers       7000000

In [107]:
df.iloc[0:2,[0,3]]

                 name  gross salary
100111  Raven Bierman       7000000
100112  Valter Havers       7000000

In [106]:
df.iloc[0:2,0:2]

                 name  gender
100111  Raven Bierman  Female
100112  Valter Havers    Male

In [115]:
# indexing dgn condition
df['gross salary']>10000000

100111    False
100112    False
200210     True
200211     True
200312     True
300207     True
Name: gross salary, dtype: bool

In [116]:
# menampilkan dataframe dgn cara indexing dgn condition
df[df['gross salary']>10000000]

                   name  gender   hire date  gross salary
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tielmans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [117]:
select = df['gross salary']>10000000
df[select]

                   name  gender   hire date  gross salary
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tielmans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [118]:
df[df['gross salary']>10000000]['name']
# menampilkan nama dari data yg memiliki gross salary > 10000000

200210      Marko Mendell
200211    Takahiro Momota
200312    Yahiko Tielmans
300207       Dina Rebaine
Name: name, dtype: object

In [121]:
df[(df['gross salary']>10000000) & (df['gender']=='Female')]
# menampilkan >1 kondisi dengan simbol and (&)

                name  gender   hire date  gross salary
300207  Dina Rebaine  Female  2015-03-20      15000000

In [122]:
df[(df['gross salary']>10000000) & (df['gender']=='Female')]['name']

300207    Dina Rebaine
Name: name, dtype: object

# group by

In [123]:
df

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tielmans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [124]:
df.groupby('gender').mean()
# menampilkan rata-rata data di df berdasarkan gender

        gross salary
gender
Female      11000000
Male        13500000

In [126]:
group = df.groupby('gender')

# menghiting jumlah data 
group.count()

        name  hire date  gross salary
gender
Female     2          2             2
Male       4          4             4

In [127]:
# standar deviasi
group.std()

        gross salary
gender
Female  5.656854e+06
Male    5.446712e+06

In [128]:
group.min()

                 name   hire date  gross salary
gender
Female   Dina Rebaine  2015-03-20       7000000
Male    Marko Mendell  2016-11-18       7000000

In [129]:
group.max()

                   name   hire date  gross salary
gender
Female    Raven Bierman  2016-12-04      15000000
Male    Yahiko Tielmans  2018-07-04      20000000

# Method

In [130]:
df

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tielmans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [131]:
# menampilkan 5 data awal dari dataframe
df.head()

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tielmans    Male  2017-05-26      20000000

In [132]:
# menampilkan 5 data terakhir dari dataframe
df.tail()

                   name  gender   hire date  gross salary
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tielmans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [133]:
# informasi df, seperti type data dan apakah ada null value
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 100111 to 300207
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   name          6 non-null      object
 1   gender        6 non-null      object
 2   hire date     6 non-null      object
 3   gross salary  6 non-null      int64
dtypes: int64(1), object(3)
memory usage: 400.0+ bytes

In [134]:
df.describe()

       gross salary
count  6.000000e+00
mean   1.266667e+07
std    5.085928e+06
min    7.000000e+06
25%    8.250000e+06
50%    1.350000e+07
75%    1.500000e+07
max    2.000000e+07

In [135]:
# deskripsi statistika
df.describe(include=object)

                 name gender   hire date
count               6      6           6
unique              6      2           6
top     Raven Bierman   Male  2016-11-18
freq                1      4           1

In [137]:
df.shape

(6, 4)

In [138]:
df.columns

Index(['name', 'gender', 'hire date', 'gross salary'], dtype='object')

In [139]:
df.index

Int64Index([100111, 100112, 200210, 200211, 200312, 300207], dtype='int64')

In [142]:
df['gender'].unique()
# ada data unique apa saja dalam suatu series/kolom

array(['Female', 'Male'], dtype=object)

In [143]:
df['gender'].nunique()
# jumlah data unique dalam suatu series/kolom

2

In [146]:
df.sort_values('gross salary')
# mengurutkan data dari kecil ke besar / ascending

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200210    Marko Mendell    Male  2018-07-04      15000000
300207     Dina Rebaine  Female  2015-03-20      15000000
200312  Yahiko Tielmans    Male  2017-05-26      20000000

In [147]:
df.sort_values('gross salary', ascending=False)
# mengurutkan data dari besar ke kecil / descending

                   name  gender   hire date  gross salary
200312  Yahiko Tielmans    Male  2017-05-26      20000000
200210    Marko Mendell    Male  2018-07-04      15000000
300207     Dina Rebaine  Female  2015-03-20      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000